Revit 2027 API
RebarHostData.IsValidHost Method
Overload List
Name | Description
IsValidHost() |  Reports whether the element is a valid rebar host.
IsValidHost(Element) |  Identifies whether a given element can host reinforcement.
Top
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace